In [1]:
import pandas as pd

In [2]:
from glob import glob

In [3]:
print("Bem Vindo(a) :D ")

Bem Vindo(a) :D

In [4]:
print("Lendo bases...")

Lendo bases...

### Leitura das bases

In [5]:
df_base_atestados = pd.read_excel(glob("bases/base_ambulatorio/*")[0], index_col = None)

In [6]:
df_base_lojas_centro = pd.read_excel(glob("bases/base_nomes_lojas/*")[0], index_col = None)

In [7]:
df_dicionario_funcoes = pd.read_excel(glob("bases/base_nomes_funcao/*")[0], index_col = None)

In [8]:
df_dicionario_funcoes.head()

                           funcao  codigo
0           ANALISTA DE PEDIDO JR       1
1          ANALISTA DE PEDIDOS PL       2
2                        APRENDIZ       3
3          ASSIST. ADMINISTRATIVO       4
4  ASSIST. DE CRIACAO DE CONTEUDO       5

In [9]:
df_base_lojas_copiado = df_base_lojas_centro.copy()

In [10]:
df_base_lojas_genero = df_base_lojas_centro.copy()

In [11]:
df_base_atestados.columns = ['data_sap','matricula','nome','idade','sexo','funcao','codigo_funcao','loja','centro','data_inicial','data_final','vai_inss','dias_perdidos','cib_10','grupo_doenca','codigo_grupo_doenca','lcdo_soc','','','']

In [12]:
df_base_atestados_filtrado = df_base_atestados[['data_sap','matricula','nome','idade','sexo','funcao','codigo_funcao','loja','centro','data_inicial','data_final','vai_inss','dias_perdidos','cib_10','grupo_doenca','codigo_grupo_doenca','lcdo_soc']].copy()

In [13]:
df_base_atestados_filtrado.head()

,data_sap,matricula,nome,idade,sexo,funcao,codigo_funcao,loja,centro,data_inicial,data_final,vai_inss,dias_perdidos,cib_10,grupo_doenca,codigo_grupo_doenca,lcdo_soc
0,2019-05-10 00:00:00,4402,MARIA LUIZA BARBOSA DE SOUZA RICARDO,55,F,VENDEDOR VITRINE,49.0,VENDAS - BARROSO,107.0,2019-05-08 00:00:00,2019-05-08 00:00:00,NÃO,1,Z019,EXAME DE VISÃO,NaN,SIM 30.05.2019
1,2019-05-11 00:00:00,11823,LIDIENE GONCALVES VIANA,31,F,OPERADOR(A) DE CAIXA,38.0,CAIXA - PONTA NEGRA,114.0,2019-05-10 00:00:00,2019-05-10 00:00:00,NÃO,1,NaN,OBSTÉTRICO,4.0,SIM 30.05.2019
2,2019-05-11 00:00:00,20001212,ALINE RODRIGUES DE OLIVEIRA,30,F,OPERADOR(A) DE CAIXA-LOT,36.0,LOTERIA - PVH CENTRO,201.0,2019-05-13 00:00:00,2019-05-19 00:00:00,NÃO,7,J45,RESPIRATÓRIO,2.0,SIM 30.05.2019
3,2019-05-11 00:00:00,20001212,ALINE RODRIGUES DE OLIVEIRA,30,F,OPERADOR(A) DE CAIXA-LOT,36.0,LOTERIA - PVH CENTRO,201.0,2019-05-10 00:00:00,2019-05-11 00:00:00,NÃO,2,Z76.3,ACOMPANHANTE,1.0,SIM 30.05.2019
4,2019-05-11 00:00:00,20001225,JAQUELINE RODIGUES FRANCO,27,F,OPERADOR(A) DE CAIXA,38.0,CAIXA - SHOPPING P VELHO,202.0,2019-05-20 00:00:00,2019-05-21 00:00:00,NÃO,2,R05,RESPIRATÓRIO,2.0,SIM 30.05.2019

In [14]:
df_base_atestados_filtrado = df_base_atestados_filtrado[~df_base_atestados_filtrado['matricula'].isnull()].copy()

In [15]:
df_base_atestados_filtrado = df_base_atestados_filtrado[df_base_atestados_filtrado['nome'] != 'NOME'].copy()

In [16]:
df_base_atestados_filtrado.columns

Index(['data_sap', 'matricula', 'nome', 'idade', 'sexo', 'funcao',
       'codigo_funcao', 'loja', 'centro', 'data_inicial', 'data_final',
       'vai_inss', 'dias_perdidos', 'cib_10', 'grupo_doenca',
       'codigo_grupo_doenca', 'lcdo_soc'],
      dtype='object')

#### filtro das colunas importantes

In [17]:
df_atestados_meses = df_base_atestados_filtrado[['data_inicial','dias_perdidos','loja','centro','sexo','idade','funcao','codigo_funcao','cib_10','grupo_doenca','codigo_grupo_doenca']].copy()

### Afirmando que os nomes das lojas estarão em caixa alta

In [18]:
df_atestados_meses['loja'] = df_atestados_meses['loja'].astype(str)

In [19]:
df_atestados_meses['loja'] = df_atestados_meses['loja'].str.upper()

In [20]:
### Pegando somente o dado que necessita que é o mês
df_atestados_meses['data_inicial'] = df_atestados_meses['data_inicial'].astype(str)

In [21]:
df_atestados_meses['data_inicial'] = df_atestados_meses['data_inicial'].str.replace(".","-")
df_atestados_meses['data_inicial'] = df_atestados_meses['data_inicial'].str.replace(":","-")
df_atestados_meses['data_inicial'] = df_atestados_meses['data_inicial'].str.replace(" ","-")

In [22]:
df_atestados_meses['mes'] = df_atestados_meses['data_inicial'].apply(lambda item: str(item).split('-')[1])

#  SEPARAÇÃO DOS DATA FRAMES POR FILTRO ESPECÍFICO DE CADA SITUAÇÃO


## ------ Filtro para Gerar Quantidade de licenças médicas por Unidade

In [23]:
df_licencas_unidade = df_atestados_meses[['mes','centro','dias_perdidos']].copy()

In [24]:
df_licencas_grupo_doenca = df_atestados_meses[['mes','grupo_doenca','codigo_grupo_doenca']].copy()

In [25]:
df_faixa_etaria = df_atestados_meses[['mes','idade']].copy()

In [26]:
df_bases_funcoes = df_atestados_meses[['mes','codigo_funcao']].copy()

In [27]:
df_licencas_genero = df_atestados_meses[['mes','centro','sexo']].copy()

In [28]:
df_dias_perdidos_unidade = df_licencas_unidade.copy()

In [29]:
df_atestados_meses.drop(columns = {'data_inicial'}, inplace = True)

In [30]:
df_atestados_meses['mes'] = df_atestados_meses['mes'].astype(int)

In [31]:
df_atestados_meses['mes_copiado'] = df_atestados_meses['mes'].copy()

## QUANTIDADE DE DIAS PERDIDOS E LICENÇAS POR MÊS

In [32]:
df_atestados_meses = df_atestados_meses.groupby('mes', as_index = False).agg({'mes_copiado': 'count','dias_perdidos':'sum'})

In [33]:
df_atestados_meses

   mes  mes_copiado  dias_perdidos
0    5          149            353
1    6          162            341
2    7          200            485
3    8          199            426
4    9          153            332
5   10          199            411

In [34]:
df_atestados_meses.rename(columns = {'mes_copiado':'QTE DE LICENÇAS MÉDICAS','dias_perdidos':'QTE DIAS PERDIDOS'}, inplace = True)

In [35]:
nome_mes = {1: 'JAN', 2: 'FEV', 3:'MARC', 4:'ABR', 5:'MAIO', 6:'JUN', 7:'JUL', 8:'AGO', 9:'SET', 10:'OUT', 11:'NOV' , 12: 'DEZ'}

In [36]:
df_atestados_meses['nome_mes'] = df_atestados_meses['mes'].map(nome_mes)

In [37]:
df_atestados_meses

   mes  QTE DE LICENÇAS MÉDICAS  QTE DIAS PERDIDOS nome_mes
0    5                      149                353     MAIO
1    6                      162                341      JUN
2    7                      200                485      JUL
3    8                      199                426      AGO
4    9                      153                332      SET
5   10                      199                411      OUT

In [38]:
df_atestados_meses.sort_values(by = ['mes'], ascending = True, inplace = True)

In [39]:
df_atestados_meses

   mes  QTE DE LICENÇAS MÉDICAS  QTE DIAS PERDIDOS nome_mes
0    5                      149                353     MAIO
1    6                      162                341      JUN
2    7                      200                485      JUL
3    8                      199                426      AGO
4    9                      153                332      SET
5   10                      199                411      OUT

In [40]:
df_atestados_meses = df_atestados_meses.T

In [41]:
df_atestados_meses

                            0    1    2    3    4    5
mes                         5    6    7    8    9   10
QTE DE LICENÇAS MÉDICAS   149  162  200  199  153  199
QTE DIAS PERDIDOS         353  341  485  426  332  411
nome_mes                 MAIO  JUN  JUL  AGO  SET  OUT

In [42]:
#Reorganizando os meses com os respectivos nomes
df_atestados_meses.columns = df_atestados_meses.loc['nome_mes'] 
df_atestados_meses.columns.name = None

In [43]:
df_atestados_meses

                         MAIO  JUN  JUL  AGO  SET  OUT
mes                         5    6    7    8    9   10
QTE DE LICENÇAS MÉDICAS   149  162  200  199  153  199
QTE DIAS PERDIDOS         353  341  485  426  332  411
nome_mes                 MAIO  JUN  JUL  AGO  SET  OUT

In [44]:
df_atestados_meses.drop(['mes', 'nome_mes'], inplace = True)

In [45]:
df_atestados_meses

                        MAIO  JUN  JUL  AGO  SET  OUT
QTE DE LICENÇAS MÉDICAS  149  162  200  199  153  199
QTE DIAS PERDIDOS        353  341  485  426  332  411

In [46]:
lista_colunas = df_atestados_meses.columns

lista_meses = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

lista_meses = [x for x in lista_meses if x not in lista_colunas]

In [47]:
lista_meses

['JAN', 'FEV', 'MAR', 'ABR', 'NOV', 'DEZ']

In [48]:
for mes in lista_meses:
    df_atestados_meses[mes] = 0

In [49]:
df_atestados_meses.rename(columns = {'JAN': 1,"FEV":2,"MAR":3,"ABR":4,"MAIO":5,"JUN":6,"JUL":7,"AGO":8,"SET":9,"OUT":10,"NOV":11,"DEZ":12}, inplace = True)

In [50]:
df_atestados_meses.sort_index(axis = 1, inplace = True)

In [51]:
df_atestados_meses.rename(columns = {1: 'JANEIRO',2:"FEV",3:"MAR",4:"ABR",5:"MAIO",6:"JUN",7:"JUL",8:"AGO",9:"SET",10:"OUT",11:"NOV",12:"DEZ"}, inplace = True)

In [52]:
df_atestados_meses

,JANEIRO,FEV,MAR,ABR,MAIO,JUN,JUL,AGO,SET,OUT,NOV,DEZ
QTE DE LICENÇAS MÉDICAS,0,0,0,0,149,162,200,199,153,199,0,0
QTE DIAS PERDIDOS,0,0,0,0,353,341,485,426,332,411,0,0

## QUANTIDADE DE LICENÇAS MÉDICAS POR UNIDADE

### Função que tem por finalidade dizer onde tem traço e trazer so a segunda posição, ou seja, restando somente o nome da loja

In [53]:
# def consertando(row):
#     if '-' in row['loja']:
#         row['loja'] = row['loja'].split('-')[1]
#     return row

# df_licencas_unidade = df_licencas_unidade.apply(consertando, axis = 1)

## Contando pelo centro a quantidade de licenças médicas por unidade

## data frame para renomear as lojas

In [54]:
df_base_lojas_centro.shape

(44, 2)

In [55]:
df_base_lojas_centro.head()

           loja  centro
0     ARIQUEMES     206
1       AVENIDA     103
2       BARROSO     107
3  BEMOL ONLINE     102
4       CAMAPUÃ     118

In [56]:
df_licencas_unidade['centro'] = df_licencas_unidade['centro'].astype(int)

In [57]:
df_licencas_unidade['mes_unidades_copiado'] = df_licencas_unidade['mes'].copy()

In [58]:
df_licencas_unidade['mes'] = df_licencas_unidade['mes'].astype(int)

In [59]:
df_licencas_unidade.head()

   mes  centro dias_perdidos mes_unidades_copiado
0    5     107             1                   05
1    5     114             1                   05
2    5     201             7                   05
3    5     201             2                   05
4    5     202             2                   05

In [60]:
lista_ordenacao = ['','a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j','k','l'] ##################################

In [61]:
df_licencas_unidade.head()

   mes  centro dias_perdidos mes_unidades_copiado
0    5     107             1                   05
1    5     114             1                   05
2    5     201             7                   05
3    5     201             2                   05
4    5     202             2                   05

In [62]:
for mes in df_licencas_unidade['mes'].unique():
    
    df_aux = df_licencas_unidade[df_licencas_unidade['mes'] == mes].copy()
   
    df_agrupado = df_aux.groupby(['centro'], as_index = False).agg({'mes_unidades_copiado': 'count'}).copy()
       
    df_agrupado.rename(columns={"mes_unidades_copiado": lista_ordenacao[mes]}, inplace = True)
    
    df_base_lojas_centro = pd.merge(df_base_lojas_centro, df_agrupado, on = ['centro'], how = 'outer')
    
    df_base_lojas_centro.fillna(0, inplace = True)

In [63]:
df_base_lojas_centro.head()

           loja  centro     e     f     g     h     i     j
0     ARIQUEMES     206   0.0   0.0   0.0   0.0   0.0   0.0
1       AVENIDA     103   6.0   8.0   9.0  15.0   5.0  15.0
2       BARROSO     107  11.0   4.0   9.0   2.0   2.0   4.0
3  BEMOL ONLINE     102   0.0   4.0   3.0   3.0   1.0   2.0
4       CAMAPUÃ     118   8.0  10.0  10.0  19.0  18.0  13.0

In [64]:
df_base_lojas_centro.rename(columns = {"centro":"a_centro", "loja":'a_loja'}, inplace = True)

In [65]:
df_base_lojas_centro.head()

         a_loja  a_centro     e     f     g     h     i     j
0     ARIQUEMES       206   0.0   0.0   0.0   0.0   0.0   0.0
1       AVENIDA       103   6.0   8.0   9.0  15.0   5.0  15.0
2       BARROSO       107  11.0   4.0   9.0   2.0   2.0   4.0
3  BEMOL ONLINE       102   0.0   4.0   3.0   3.0   1.0   2.0
4       CAMAPUÃ       118   8.0  10.0  10.0  19.0  18.0  13.0

In [66]:
df_base_lojas_centro.head()

         a_loja  a_centro     e     f     g     h     i     j
0     ARIQUEMES       206   0.0   0.0   0.0   0.0   0.0   0.0
1       AVENIDA       103   6.0   8.0   9.0  15.0   5.0  15.0
2       BARROSO       107  11.0   4.0   9.0   2.0   2.0   4.0
3  BEMOL ONLINE       102   0.0   4.0   3.0   3.0   1.0   2.0
4       CAMAPUÃ       118   8.0  10.0  10.0  19.0  18.0  13.0

In [67]:
df_base_lojas_centro.sort_index(axis = 1, inplace = True)

In [68]:
dic_mes_alfabeto = {'a': 'JAN', 'b': 'FEV', 'c': 'MAR', 'd': 'ABR', 'e':'MAIO', 'f':'JUN', 'g':'JUL', 'h':'AGO', 'i':'SET', 'j':'OUT', 'k':'NOV','l':'DEZ'}

In [69]:
df_base_lojas_centro.head()

   a_centro        a_loja     e     f     g     h     i     j
0       206     ARIQUEMES   0.0   0.0   0.0   0.0   0.0   0.0
1       103       AVENIDA   6.0   8.0   9.0  15.0   5.0  15.0
2       107       BARROSO  11.0   4.0   9.0   2.0   2.0   4.0
3       102  BEMOL ONLINE   0.0   4.0   3.0   3.0   1.0   2.0
4       118       CAMAPUÃ   8.0  10.0  10.0  19.0  18.0  13.0

In [70]:
for name in df_base_lojas_centro.columns[2:]:
    df_base_lojas_centro.rename(columns = {name: dic_mes_alfabeto[name]},inplace = True)

In [71]:
df_base_lojas_centro.head()

   a_centro        a_loja  MAIO   JUN   JUL   AGO   SET   OUT
0       206     ARIQUEMES   0.0   0.0   0.0   0.0   0.0   0.0
1       103       AVENIDA   6.0   8.0   9.0  15.0   5.0  15.0
2       107       BARROSO  11.0   4.0   9.0   2.0   2.0   4.0
3       102  BEMOL ONLINE   0.0   4.0   3.0   3.0   1.0   2.0
4       118       CAMAPUÃ   8.0  10.0  10.0  19.0  18.0  13.0

In [72]:
df_base_lojas_centro.columns

Index(['a_centro', 'a_loja', 'MAIO', 'JUN', 'JUL', 'AGO', 'SET', 'OUT'], dtype='object')

In [73]:
lista_colunas = df_base_lojas_centro.columns

lista_semestre = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

if "JUL" in lista_colunas:
    lista_meses = [x for x in lista_semestre if x not in lista_colunas]
else:
    lista_meses = [x for x in lista_semestre if x not in lista_colunas]

In [74]:
lista_meses

['JAN', 'FEV', 'MAR', 'ABR', 'NOV', 'DEZ']

In [75]:
for mes in lista_meses:
    df_base_lojas_centro[mes] = 0

In [76]:
df_base_lojas_centro = df_base_lojas_centro[["a_loja","JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]].copy()

In [77]:
df_base_lojas_centro.rename(columns = {'a_loja':'LOJA'}, inplace = True)

In [78]:
df_qtd_atestados_unidade = df_base_lojas_centro.copy()

##  QUANTIDADE DE DIAS PERDIDOS POR MÊS

In [79]:
df_dias_perdidos_unidade['mes'] = df_dias_perdidos_unidade['mes'].astype(int)

In [80]:
df_dias_perdidos_unidade['centro'] = df_dias_perdidos_unidade['centro'].astype(int)

In [81]:
df_dias_perdidos_unidade.head()

   mes  centro dias_perdidos
0    5     107             1
1    5     114             1
2    5     201             7
3    5     201             2
4    5     202             2

In [82]:
df_base_lojas_copiado.head()

           loja  centro
0     ARIQUEMES     206
1       AVENIDA     103
2       BARROSO     107
3  BEMOL ONLINE     102
4       CAMAPUÃ     118

In [83]:
df_aux.head()

     mes  centro dias_perdidos mes_unidades_copiado
860   10     202             1                   10
865   10     106             1                   10
866   10     118             1                   10
868   10     115             3                   10
869   10     103             1                   10

In [84]:
df_dias_perdidos_unidade.dias_perdidos = df_dias_perdidos_unidade.dias_perdidos.astype(int)

In [85]:
df_dias_perdidos_unidade.columns

Index(['mes', 'centro', 'dias_perdidos'], dtype='object')

In [86]:
for mes in df_dias_perdidos_unidade['mes'].unique():
    
    df_aux = df_dias_perdidos_unidade[df_dias_perdidos_unidade['mes'] == mes].copy()
    
    df_aux.drop(labels='mes',inplace=True,axis=1)
   
    df_agrupando = df_aux.groupby(['centro']).sum().reset_index()
       
    df_agrupando.rename(columns = {"dias_perdidos": lista_ordenacao[mes]}, inplace = True)
    
    df_base_lojas_copiado = pd.merge(df_base_lojas_copiado, df_agrupando, on = ['centro'], how = 'outer')
    
    df_base_lojas_copiado.fillna(0, inplace = True)

In [87]:
df_base_lojas_copiado.head()

           loja  centro     e     f     g     h     i     j
0     ARIQUEMES     206   0.0   0.0   0.0   0.0   0.0   0.0
1       AVENIDA     103  29.0  23.0  14.0  24.0   6.0  58.0
2       BARROSO     107  30.0   6.0  27.0   2.0   2.0   4.0
3  BEMOL ONLINE     102   0.0   4.0  11.0   5.0   1.0   3.0
4       CAMAPUÃ     118  28.0  25.0  24.0  28.0  38.0  35.0

In [88]:
df_base_lojas_copiado.rename(columns = {"centro":"a_centro", "loja":'a_loja'}, inplace = True)

In [89]:
df_base_lojas_copiado.head()

         a_loja  a_centro     e     f     g     h     i     j
0     ARIQUEMES       206   0.0   0.0   0.0   0.0   0.0   0.0
1       AVENIDA       103  29.0  23.0  14.0  24.0   6.0  58.0
2       BARROSO       107  30.0   6.0  27.0   2.0   2.0   4.0
3  BEMOL ONLINE       102   0.0   4.0  11.0   5.0   1.0   3.0
4       CAMAPUÃ       118  28.0  25.0  24.0  28.0  38.0  35.0

In [90]:
df_base_lojas_copiado.sort_index(axis = 1, inplace = True)

In [91]:
df_base_lojas_copiado.head()

   a_centro        a_loja     e     f     g     h     i     j
0       206     ARIQUEMES   0.0   0.0   0.0   0.0   0.0   0.0
1       103       AVENIDA  29.0  23.0  14.0  24.0   6.0  58.0
2       107       BARROSO  30.0   6.0  27.0   2.0   2.0   4.0
3       102  BEMOL ONLINE   0.0   4.0  11.0   5.0   1.0   3.0
4       118       CAMAPUÃ  28.0  25.0  24.0  28.0  38.0  35.0

In [92]:
for name in df_base_lojas_copiado.columns[2:]:
    df_base_lojas_copiado.rename(columns = {name: dic_mes_alfabeto[name]},inplace = True)

In [93]:
df_base_lojas_copiado.head()

   a_centro        a_loja  MAIO   JUN   JUL   AGO   SET   OUT
0       206     ARIQUEMES   0.0   0.0   0.0   0.0   0.0   0.0
1       103       AVENIDA  29.0  23.0  14.0  24.0   6.0  58.0
2       107       BARROSO  30.0   6.0  27.0   2.0   2.0   4.0
3       102  BEMOL ONLINE   0.0   4.0  11.0   5.0   1.0   3.0
4       118       CAMAPUÃ  28.0  25.0  24.0  28.0  38.0  35.0

In [94]:
lista_colunas = df_base_lojas_copiado.columns

lista_semestre = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

if "JUL" in lista_colunas:
    lista_meses = [x for x in lista_semestre if x not in lista_colunas]
else:
    lista_meses = [x for x in lista_semestre if x not in lista_colunas]

In [95]:
for mes in lista_meses:
    df_base_lojas_copiado[mes] = 0

In [96]:
df_base_lojas_copiado.head()

,a_centro,a_loja,MAIO,JUN,JUL,AGO,SET,OUT,JAN,FEV,MAR,ABR,NOV,DEZ
0,206,ARIQUEMES,0.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0,0,0
1,103,AVENIDA,29.0,23.0,14.0,24.0,6.0,58.0,0,0,0,0,0,0
2,107,BARROSO,30.0,6.0,27.0,2.0,2.0,4.0,0,0,0,0,0,0
3,102,BEMOL ONLINE,0.0,4.0,11.0,5.0,1.0,3.0,0,0,0,0,0,0
4,118,CAMAPUÃ,28.0,25.0,24.0,28.0,38.0,35.0,0,0,0,0,0,0

In [97]:
df_base_lojas_copiado = df_base_lojas_copiado[["a_loja","JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]].copy()

In [98]:
df_base_lojas_copiado.head()

,a_loja,JAN,FEV,MAR,ABR,MAIO,JUN,JUL,AGO,SET,OUT,NOV,DEZ
0,ARIQUEMES,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
1,AVENIDA,0,0,0,0,29.0,23.0,14.0,24.0,6.0,58.0,0,0
2,BARROSO,0,0,0,0,30.0,6.0,27.0,2.0,2.0,4.0,0,0
3,BEMOL ONLINE,0,0,0,0,0.0,4.0,11.0,5.0,1.0,3.0,0,0
4,CAMAPUÃ,0,0,0,0,28.0,25.0,24.0,28.0,38.0,35.0,0,0

In [99]:
df_base_lojas_copiado.head()

,a_loja,JAN,FEV,MAR,ABR,MAIO,JUN,JUL,AGO,SET,OUT,NOV,DEZ
0,ARIQUEMES,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
1,AVENIDA,0,0,0,0,29.0,23.0,14.0,24.0,6.0,58.0,0,0
2,BARROSO,0,0,0,0,30.0,6.0,27.0,2.0,2.0,4.0,0,0
3,BEMOL ONLINE,0,0,0,0,0.0,4.0,11.0,5.0,1.0,3.0,0,0
4,CAMAPUÃ,0,0,0,0,28.0,25.0,24.0,28.0,38.0,35.0,0,0

In [100]:
df_base_lojas_copiado.rename(columns = {'a_loja':'LOJA'}, inplace = True)

In [101]:
df_base_lojas_copiado.head()

,LOJA,JAN,FEV,MAR,ABR,MAIO,JUN,JUL,AGO,SET,OUT,NOV,DEZ
0,ARIQUEMES,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
1,AVENIDA,0,0,0,0,29.0,23.0,14.0,24.0,6.0,58.0,0,0
2,BARROSO,0,0,0,0,30.0,6.0,27.0,2.0,2.0,4.0,0,0
3,BEMOL ONLINE,0,0,0,0,0.0,4.0,11.0,5.0,1.0,3.0,0,0
4,CAMAPUÃ,0,0,0,0,28.0,25.0,24.0,28.0,38.0,35.0,0,0

In [102]:
df_qtd_dias_perdidos_unidade = df_base_lojas_copiado.copy()

In [103]:
df_qtd_dias_perdidos_unidade

,LOJA,JAN,FEV,MAR,ABR,MAIO,JUN,JUL,AGO,SET,OUT,NOV,DEZ
0,ARIQUEMES,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
1,AVENIDA,0,0,0,0,29.0,23.0,14.0,24.0,6.0,58.0,0,0
2,BARROSO,0,0,0,0,30.0,6.0,27.0,2.0,2.0,4.0,0,0
3,BEMOL ONLINE,0,0,0,0,0.0,4.0,11.0,5.0,1.0,3.0,0,0
4,CAMAPUÃ,0,0,0,0,28.0,25.0,24.0,28.0,38.0,35.0,0,0
5,CIDADE NOVA,0,0,0,0,13.0,6.0,39.0,17.0,12.0,26.0,0,0
6,DB PONTA NEGRA,0,0,0,0,22.0,23.0,9.0,16.0,0.0,11.0,0,0
7,EDUCANDOS,0,0,0,0,37.0,8.0,10.0,25.0,16.0,9.0,0,0
8,GRANDE CIRCULAR,0,0,0,0,7.0,12.0,36.0,30.0,14.0,42.0,0,0
9,ITACOATIARA,0,0,0,0,3.0,1.0,19.0,7.0,9.0,8.0,0,0
10,JATUARANA,0,0,0,0,35.0,41.0,5.0,16.0,28.0,16.0,0,0
11,PORTO VELHO,0,0,0,0,35.0,41.0,5.0,16.0,28.0,16.0,0,0
12,JI-PARANÁ,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
13,MANACAPURU,0,0,0,0,2.0,23.0,66.0,28.0,6.0,22.0,0,0
14,MANAUARA,0,0,0,0,2.0,23.0,66.0,28.0,6.0,22.0,0,0
15,MATRIZ,0,0,0,0,13.0,4.0,4.0,4.0,16.0,7.0,0,0
16,MILLENIUM,0,0,0,0,0.0,7.0,4.0,6.0,2.0,6.0,0,0
17,NOVA CIDADE,0,0,0,0,4.0,7.0,14.0,4.0,9.0,12.0,0,0
18,PRESIDENTE FIGUEIREDO,0,0,0,0,0.0,0.0,0.0,0.0,0.0,5.0,0,0
19,SHOPPING AM,0,0,0,0,3.0,26.0,44.0,24.0,8.0,6.0,0,0
20,SHOPPING BV,0,0,0,0,15.0,32.0,31.0,36.0,14.0,5.0,0,0
21,BOA VISTA,0,0,0,0,15.0,32.0,31.0,36.0,14.0,5.0,0,0
22,SHOPPING PNEGRA,0,0,0,0,4.0,6.0,10.0,26.0,6.0,5.0,0,0
23,SHOPPING PVH,0,0,0,0,26.0,27.0,22.0,14.0,8.0,4.0,0,0
24,SHOPPING RB,0,0,0,0,23.0,20.0,10.0,44.0,6.0,3.0,0,0
25,STUDIO 5,0,0,0,0,2.0,3.0,8.0,6.0,24.0,4.0,0,0
26,TORQUATO,0,0,0,0,10.0,8.0,24.0,21.0,51.0,12.0,0,0
27,FARMA AM SHOPPING,0,0,0,0,8.0,0.0,0.0,3.0,11.0,18.0,0,0
28,FARMA BOA VISTA,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
29,FARMA DB PONTA NEGRA,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
30,FARMA DJALMA,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
31,FARMA GRANDE CIRCULAR,0,0,0,0,0.0,3.0,3.0,1.0,2.0,2.0,0,0
32,FARMA MATRIZ,0,0,0,0,0.0,1.0,0.0,0.0,0.0,1.0,0,0
33,FARMA MANAUARA,0,0,0,0,5.0,0.0,0.0,0.0,0.0,1.0,0,0
34,FARMA NOVA CIDADE,0,0,0,0,1.0,0.0,1.0,0.0,0.0,0.0,0,0
35,FARMA PORTO VELHO,0,0,0,0,0.0,4.0,0.0,0.0,0.0,0.0,0,0
36,FARMA SH PNEGRA,0,0,0,0,3.0,4.0,2.0,0.0,2.0,1.0,0,0
37,FARMA TORQUATO,0,0,0,0,15.0,0.0,0.0,0.0,4.0,8.0,0,0
38,CD-MANAUS,0,0,0,0,0.0,2.0,1.0,3.0,17.0,43.0,0,0
39,CD-PORTO VELHO,0,0,0,0,0.0,9.0,8.0,19.0,5.0,24.0,0,0
40,CD-RIO BRANCO,0,0,0,0,1.0,2.0,22.0,4.0,0.0,4.0,0,0
41,ESCRITÓRIO CENTRAL,0,0,0,0,11.0,3.0,1.0,1.0,0.0,1.0,0,0
42,FARMA ITACOATIARA,0,0,0,0,0.0,0.0,0.0,4.0,0.0,0.0,0,0
43,MANACAPURU,0,0,0,0,3.0,1.0,16.0,8.0,15.0,5.0,0,0

## QUANTITATIVO DE LICENÇAS MÉDICAS POR GÊNERO

In [104]:
df_licencas_genero['centro'] = df_licencas_genero['centro'].astype(int)

In [105]:
df_licencas_genero['mes'] = df_licencas_genero['mes'].astype(int)

In [106]:
## deixandos todos em caixa alta
df_licencas_genero['sexo'] = df_licencas_genero['sexo'].str.upper()

In [107]:
df_licencas_genero.drop(columns = {"centro"}, inplace  = True)

In [108]:
df_feminino = df_licencas_genero[df_licencas_genero['sexo'] == 'F'].copy()

In [109]:
df_masculino = df_licencas_genero[df_licencas_genero['sexo'] == 'M'].copy()

In [110]:
df_feminino = df_feminino.groupby('mes', as_index = False).agg({'sexo': 'count'})

In [111]:
############################## CONTAGEM DOS FEMININOS #################

In [112]:
nome_mes_genero = {1: 'JAN', 2: 'FEV', 3:'MARC', 4:'ABR', 5:'MAIO', 6:'JUN', 7:'JUL', 8:'AGO', 9:'SET', 10:'OUT', 11:'NOV' , 12: 'DEZ'}

In [113]:
df_feminino

   mes  sexo
0    5   120
1    6   116
2    7   130
3    8   138
4    9   109
5   10   120

In [114]:
df_feminino['nome_mes_genero'] = df_feminino['mes'].map(nome_mes_genero)

In [115]:
df_feminino

   mes  sexo nome_mes_genero
0    5   120            MAIO
1    6   116             JUN
2    7   130             JUL
3    8   138             AGO
4    9   109             SET
5   10   120             OUT

In [116]:
df_feminino.rename(columns = {"sexo":"FEMININO"}, inplace = True)

In [117]:
df_feminino.sort_values(by = ['mes'], ascending = True, inplace = True)

In [118]:
df_feminino = df_feminino.T

In [119]:
df_feminino

                    0    1    2    3    4    5
mes                 5    6    7    8    9   10
FEMININO          120  116  130  138  109  120
nome_mes_genero  MAIO  JUN  JUL  AGO  SET  OUT

In [120]:
#Reorganizando os meses com os respectivos nomes
df_feminino.columns = df_feminino.loc['nome_mes_genero'] 
df_feminino.columns.name = None

In [121]:
df_feminino

                 MAIO  JUN  JUL  AGO  SET  OUT
mes                 5    6    7    8    9   10
FEMININO          120  116  130  138  109  120
nome_mes_genero  MAIO  JUN  JUL  AGO  SET  OUT

In [122]:
df_feminino.drop(['mes', 'nome_mes_genero'], inplace = True)

In [123]:
df_feminino

         MAIO  JUN  JUL  AGO  SET  OUT
FEMININO  120  116  130  138  109  120

In [124]:
lista_colunas_genero = df_feminino.columns

lista_meses_genero = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

lista_meses_genero = [x for x in lista_meses_genero if x not in lista_colunas_genero]

In [125]:
lista_meses_genero

['JAN', 'FEV', 'MAR', 'ABR', 'NOV', 'DEZ']

In [126]:
for mes in lista_meses_genero:
    df_feminino[mes] = 0

In [127]:
df_feminino

         MAIO  JUN  JUL  AGO  SET  OUT  JAN  FEV  MAR  ABR  NOV  DEZ
FEMININO  120  116  130  138  109  120    0    0    0    0    0    0

In [128]:
df_feminino.rename(columns = {'JAN': 1,"FEV":2,"MAR":3,"ABR":4,"MAIO":5,"JUN":6,"JUL":7,"AGO":8,"SET":9,"OUT":10,"NOV":11,"DEZ":12}, inplace = True)

In [129]:
df_feminino.sort_index(axis = 1, inplace = True)

In [130]:
df_feminino.rename(columns = {1: 'JANEIRO',2:"FEV",3:"MAR",4:"ABR",5:"MAIO",6:"JUN",7:"JUL",8:"AGO",9:"SET",10:"OUT",11:"NOV",12:"DEZ"}, inplace = True)

In [131]:
df_feminino

          JANEIRO  FEV  MAR  ABR MAIO  JUN  JUL  AGO  SET  OUT  NOV  DEZ
FEMININO        0    0    0    0  120  116  130  138  109  120    0    0

In [132]:
#################### Inicio da contagem dos MASCULINOS ##############################

In [133]:
df_masculino = df_masculino.groupby('mes', as_index = False).agg({'sexo': 'count'})

In [134]:
df_masculino

   mes  sexo
0    5    29
1    6    46
2    7    70
3    8    61
4    9    44
5   10    79

In [135]:
df_masculino['nome_mes_genero'] = df_masculino['mes'].map(nome_mes_genero)

In [136]:
df_masculino

   mes  sexo nome_mes_genero
0    5    29            MAIO
1    6    46             JUN
2    7    70             JUL
3    8    61             AGO
4    9    44             SET
5   10    79             OUT

In [137]:
df_masculino.rename(columns = {"sexo":"MASCULINO"}, inplace = True)

In [138]:
df_masculino.sort_values(by = ['mes'], ascending = True, inplace = True)

In [139]:
df_masculino = df_masculino.T

In [140]:
df_masculino

                    0    1    2    3    4    5
mes                 5    6    7    8    9   10
MASCULINO          29   46   70   61   44   79
nome_mes_genero  MAIO  JUN  JUL  AGO  SET  OUT

In [141]:
#Reorganizando os meses com os respectivos nomes
df_masculino.columns = df_masculino.loc['nome_mes_genero'] 
df_masculino.columns.name = None

In [142]:
df_masculino

                 MAIO  JUN  JUL  AGO  SET  OUT
mes                 5    6    7    8    9   10
MASCULINO          29   46   70   61   44   79
nome_mes_genero  MAIO  JUN  JUL  AGO  SET  OUT

In [143]:
df_masculino.drop(['mes', 'nome_mes_genero'], inplace = True)

In [144]:
df_masculino

          MAIO JUN JUL AGO SET OUT
MASCULINO   29  46  70  61  44  79

In [145]:
lista_colunas_genero = df_masculino.columns

lista_meses_genero = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

lista_meses_genero = [x for x in lista_meses_genero if x not in lista_colunas_genero]

In [146]:
for mes in lista_meses_genero:
    df_masculino[mes] = 0

In [147]:
df_masculino

          MAIO JUN JUL AGO SET OUT  JAN  FEV  MAR  ABR  NOV  DEZ
MASCULINO   29  46  70  61  44  79    0    0    0    0    0    0

In [148]:
df_masculino.rename(columns = {'JAN': 1,"FEV":2,"MAR":3,"ABR":4,"MAIO":5,"JUN":6,"JUL":7,"AGO":8,"SET":9,"OUT":10,"NOV":11,"DEZ":12}, inplace = True)

In [149]:
df_masculino

           5   6   7   8   9   10  1   2   3   4   11  12
MASCULINO  29  46  70  61  44  79   0   0   0   0   0   0

In [150]:
df_masculino.sort_index(axis = 1, inplace = True)

In [151]:
df_masculino

           1   2   3   4   5   6   7   8   9   10  11  12
MASCULINO   0   0   0   0  29  46  70  61  44  79   0   0

In [152]:
df_masculino.rename(columns = {1: 'JANEIRO',2:"FEV",3:"MAR",4:"ABR",5:"MAIO",6:"JUN",7:"JUL",8:"AGO",9:"SET",10:"OUT",11:"NOV",12:"DEZ"}, inplace = True)

In [153]:
df_masculino

           JANEIRO  FEV  MAR  ABR MAIO JUN JUL AGO SET OUT  NOV  DEZ
MASCULINO        0    0    0    0   29  46  70  61  44  79    0    0

In [154]:
df_final_genero = pd.concat([df_feminino,df_masculino])

In [155]:
df_final_genero

           JANEIRO  FEV  MAR  ABR MAIO  JUN  JUL  AGO  SET  OUT  NOV  DEZ
FEMININO         0    0    0    0  120  116  130  138  109  120    0    0
MASCULINO        0    0    0    0   29   46   70   61   44   79    0    0

## Quantidade de Licenças médicas por intervalo de idade

In [156]:
df_faixa_etaria.head()

  mes idade
0  05    55
1  05    31
2  05    30
3  05    30
4  05    27

In [157]:
df_faixa_etaria['idade'] = df_faixa_etaria['idade'].astype(int)
df_faixa_etaria['mes'] = df_faixa_etaria['mes'].astype(int)

In [158]:
# def faixa_etaria(idade):
#     if idade<=29:
#         return 'idade_16_29'
#     elif idade>=30 and idade<=39:
#         return 'idade_30_39'
#     elif idade>=40 and idade<=49:
#         return 'idade_40_49'
#     elif idade>=50 and idade<=59:
#         return 'idade_50_59'
#     elif idade>=60:
#         return 'idade_maior_60'

In [159]:
# df_faixa_etaria['faixa'] = df_faixa_etaria['idade'].apply(faixa_etaria)

In [160]:
# a.groupby(['faixa', 'mes'])['idade'].count().reset_index()

In [161]:
for mes in df_faixa_etaria['mes'].unique(): 
    
    df_aux = df_faixa_etaria[df_faixa_etaria['mes'] == mes].copy()
    
    df_16_29 = df_faixa_etaria[(df_faixa_etaria['idade']<=29)]
    df_16_29 = df_16_29.groupby(['mes'], as_index = False).agg({'idade': 'count'})
    
    df_30_39 = df_faixa_etaria[(df_faixa_etaria['idade']>=30) & (df_faixa_etaria['idade']<=39)]
    df_30_39 = df_30_39.groupby(['mes'], as_index = False).agg({'idade': 'count'})
    
    df_40_49 = df_faixa_etaria[(df_faixa_etaria['idade']>=40) & (df_faixa_etaria['idade']<=49)]
    df_40_49 = df_40_49.groupby(['mes'], as_index = False).agg({'idade': 'count'})
        
    df_50_59 = df_faixa_etaria[(df_faixa_etaria['idade']>=50) & (df_faixa_etaria['idade']<=59)]
    df_50_59 = df_50_59.groupby(['mes'], as_index = False).agg({'idade': 'count'})
    
    df_acima_60 = df_faixa_etaria[(df_faixa_etaria['idade']>=60)]
    df_acima_60 = df_acima_60.groupby(['mes'], as_index = False).agg({'idade': 'count'})

### CODIGO DO LEO QUE SEPARA AS FAIXAS E PELO MES

In [162]:
# df = pd.DataFrame()

# for faixa in faixas:
#         aux = df_faixa_etaria[df_faixa_etaria['faixa'] == faixa].copy()
#         aux = aux.groupby(['faixa', 'mes'])['idade'].count().reset_index()
#         df = pd.concat([df,aux])
#         df['mes'] = df['mes'].astype(str)
#         df_teste = df[df['faixa'] == faixa]
#         df = df.astype(str)    
#         df_final_etaria = pd.merge(df_meses,df, on = 'mes', how = 'outer')

### Renomeando as colunas

In [163]:
df_16_29.rename(columns = {"idade":"16 A 29 ANOS"}, inplace = True)
df_30_39.rename(columns = {"idade":"30 A 39 ANOS"}, inplace = True)
df_40_49.rename(columns = {"idade":"40 A 49 ANOS"}, inplace = True)
df_50_59.rename(columns = {"idade":"50 A 59 ANOS"}, inplace = True)
df_acima_60.rename(columns = {"idade":"ACIMA DE 60 ANOS"}, inplace = True)

In [164]:
list_meses = {'mes': [1,2,3,4,5,6,7,8,9,10,11,12]}

df_meses = pd.DataFrame(list_meses)

In [165]:
df_final_intervalos_idade = pd.merge(df_16_29,df_meses, on = 'mes', how = 'outer')

In [166]:
df_final_intervalos_idade.sort_values(by = ['mes'], ascending = True, inplace = True)

In [167]:
df_final_intervalos_idade = pd.merge(df_final_intervalos_idade, df_30_39, on  = 'mes', how = 'outer')

In [168]:
df_final_intervalos_idade = pd.merge(df_final_intervalos_idade, df_40_49, on  = 'mes', how = 'outer')

In [169]:
df_final_intervalos_idade = pd.merge(df_final_intervalos_idade, df_50_59, on  = 'mes', how = 'outer')

In [170]:
df_final_intervalos_idade = pd.merge(df_final_intervalos_idade, df_acima_60, on  = 'mes', how = 'outer')

In [171]:
df_final_intervalos_idade.fillna(0, inplace = True)

In [172]:
df_final_intervalos_idade = df_final_intervalos_idade.astype(int)

In [173]:
df_final_intervalos_idade['nome_mes_genero'] = df_final_intervalos_idade['mes'].map(nome_mes_genero)

In [174]:
df_final_intervalos_idade = df_final_intervalos_idade.T

In [175]:
df_final_intervalos_idade

                   0    1     2    3     4    5    6    7    8    9    10   11
mes                 1    2     3    4     5    6    7    8    9   10   11   12
16 A 29 ANOS        0    0     0    0    78   77  104   95   88   92    0    0
30 A 39 ANOS        0    0     0    0    61   69   76   87   48   80    0    0
40 A 49 ANOS        0    0     0    0     8   14   16   16   14   20    0    0
50 A 59 ANOS        0    0     0    0     2    1    3    1    2    6    0    0
ACIMA DE 60 ANOS    0    0     0    0     0    1    1    0    1    1    0    0
nome_mes_genero   JAN  FEV  MARC  ABR  MAIO  JUN  JUL  AGO  SET  OUT  NOV  DEZ

In [176]:
#Reorganizando os meses com os respectivos nomes
df_final_intervalos_idade.columns = df_final_intervalos_idade.loc['nome_mes_genero'] 
df_final_intervalos_idade.columns.name = None

In [177]:
df_final_intervalos_idade.drop(['mes', 'nome_mes_genero'], inplace = True)

In [178]:
df_final_intervalos_idade

                 JAN FEV MARC ABR MAIO JUN  JUL AGO SET OUT NOV DEZ
16 A 29 ANOS       0   0    0   0   78  77  104  95  88  92   0   0
30 A 39 ANOS       0   0    0   0   61  69   76  87  48  80   0   0
40 A 49 ANOS       0   0    0   0    8  14   16  16  14  20   0   0
50 A 59 ANOS       0   0    0   0    2   1    3   1   2   6   0   0
ACIMA DE 60 ANOS   0   0    0   0    0   1    1   0   1   1   0   0

## GERANDO TABELA DE QTD DE LICENÇAS POR FUNÇÃO

In [179]:
df_bases_funcoes['codigo_funcao'] = df_bases_funcoes['codigo_funcao'].astype(int)

In [180]:
df_bases_funcoes['mes_copiado'] = df_bases_funcoes['mes'].copy()

In [181]:
df_bases_funcoes['mes'] = df_bases_funcoes['mes'].astype(int)
df_bases_funcoes['mes_copiado'] = df_bases_funcoes['mes_copiado'].astype(int)

In [182]:
df_bases_funcoes.dtypes

mes              int64
codigo_funcao    int64
mes_copiado      int64
dtype: object

In [183]:
df_bases_funcoes.head(1)

   mes  codigo_funcao  mes_copiado
0    5             49            5

In [184]:
df_dicionario_funcoes.rename(columns = {'codigo':'codigo_funcao'}, inplace = True)

In [185]:
df_dicionario_funcoes.head()

                           funcao  codigo_funcao
0           ANALISTA DE PEDIDO JR              1
1          ANALISTA DE PEDIDOS PL              2
2                        APRENDIZ              3
3          ASSIST. ADMINISTRATIVO              4
4  ASSIST. DE CRIACAO DE CONTEUDO              5

### fazendo merge pelo codigo funcao e contando quantos atestados tem no mes

In [186]:
lista_ordenacao_func = ['','a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j','k','l']

In [187]:
df_dicionario_funcoes.head(1)

                  funcao  codigo_funcao
0  ANALISTA DE PEDIDO JR              1

In [188]:
for mes in df_bases_funcoes['mes'].unique():
    
    df_aux = df_bases_funcoes[df_bases_funcoes['mes'] == mes].copy()
   
    df_agrupado = df_aux.groupby(['codigo_funcao'], as_index = False).agg({'mes_copiado': 'count'}).copy()
       
    df_agrupado.rename(columns={"mes_copiado": lista_ordenacao_func[mes]}, inplace = True)
    
    df_dicionario_funcoes = pd.merge(df_dicionario_funcoes, df_agrupado, on = ['codigo_funcao'], how = 'outer')
    
    df_dicionario_funcoes.fillna(0, inplace = True)

In [189]:
df_dicionario_funcoes.head()

,funcao,codigo_funcao,e,f,g,h,i,j
0,ANALISTA DE PEDIDO JR,1,0.0,0.0,0.0,0.0,1.0,2.0
1,ANALISTA DE PEDIDOS PL,2,0.0,1.0,1.0,1.0,0.0,0.0
2,APRENDIZ,3,4.0,10.0,5.0,12.0,5.0,7.0
3,ASSIST. ADMINISTRATIVO,4,0.0,0.0,0.0,2.0,0.0,0.0
4,ASSIST. DE CRIACAO DE CONTEUDO,5,0.0,0.0,1.0,0.0,0.0,1.0

In [190]:
df_dicionario_funcoes.rename(columns = {"funcao":"a_funcao", "codigo_funcao":'a_codigo_funcao'}, inplace = True)

In [191]:
df_dicionario_funcoes.sort_index(axis = 1, inplace = True)

In [192]:
for name in df_dicionario_funcoes.columns[2:]:
    df_dicionario_funcoes.rename(columns = {name: dic_mes_alfabeto[name]},inplace = True)

In [193]:
lista_colunas_func = df_dicionario_funcoes.columns

In [194]:
lista_semestre_func = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

In [195]:
lista_semestre = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

if "JUL" in lista_colunas_func:
    lista_meses = [x for x in lista_semestre_func if x not in lista_colunas_func]
else:
    lista_meses = [x for x in lista_semestre_func if x not in lista_colunas_func]

In [196]:
for mes in lista_meses:
    df_dicionario_funcoes[mes] = 0

In [197]:
df_dicionario_funcoes.head()

,a_codigo_funcao,a_funcao,MAIO,JUN,JUL,AGO,SET,OUT,JAN,FEV,MAR,ABR,NOV,DEZ
0,1,ANALISTA DE PEDIDO JR,0.0,0.0,0.0,0.0,1.0,2.0,0,0,0,0,0,0
1,2,ANALISTA DE PEDIDOS PL,0.0,1.0,1.0,1.0,0.0,0.0,0,0,0,0,0,0
2,3,APRENDIZ,4.0,10.0,5.0,12.0,5.0,7.0,0,0,0,0,0,0
3,4,ASSIST. ADMINISTRATIVO,0.0,0.0,0.0,2.0,0.0,0.0,0,0,0,0,0,0
4,5,ASSIST. DE CRIACAO DE CONTEUDO,0.0,0.0,1.0,0.0,0.0,1.0,0,0,0,0,0,0

In [198]:
df_dicionario_funcoes = df_dicionario_funcoes[["a_funcao","JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]].copy()

In [199]:
df_dicionario_funcoes.rename(columns = {'a_funcao':'FUNÇÃO'}, inplace = True)

In [200]:
df_dicionario_funcoes['JAN'] = df_dicionario_funcoes['JAN'].astype(int)
df_dicionario_funcoes['FEV'] = df_dicionario_funcoes['FEV'].astype(int)
df_dicionario_funcoes['MAR'] = df_dicionario_funcoes['MAR'].astype(int)
df_dicionario_funcoes['ABR'] = df_dicionario_funcoes['ABR'].astype(int)
df_dicionario_funcoes['MAIO'] = df_dicionario_funcoes['MAIO'].astype(int)
df_dicionario_funcoes['JUN'] = df_dicionario_funcoes['JUN'].astype(int)
df_dicionario_funcoes['JUL'] = df_dicionario_funcoes['JUL'].astype(int)
df_dicionario_funcoes['AGO'] = df_dicionario_funcoes['AGO'].astype(int)
df_dicionario_funcoes['SET'] = df_dicionario_funcoes['SET'].astype(int)
df_dicionario_funcoes['OUT'] = df_dicionario_funcoes['OUT'].astype(int)
df_dicionario_funcoes['NOV'] = df_dicionario_funcoes['NOV'].astype(int)
df_dicionario_funcoes['DEZ'] = df_dicionario_funcoes['DEZ'].astype(int)

In [201]:
df_dicionario_funcoes.head()

,FUNÇÃO,JAN,FEV,MAR,ABR,MAIO,JUN,JUL,AGO,SET,OUT,NOV,DEZ
0,ANALISTA DE PEDIDO JR,0,0,0,0,0,0,0,0,1,2,0,0
1,ANALISTA DE PEDIDOS PL,0,0,0,0,0,1,1,1,0,0,0,0
2,APRENDIZ,0,0,0,0,4,10,5,12,5,7,0,0
3,ASSIST. ADMINISTRATIVO,0,0,0,0,0,0,0,2,0,0,0,0
4,ASSIST. DE CRIACAO DE CONTEUDO,0,0,0,0,0,0,1,0,0,1,0,0

# Quantitativo de licenças médicas por grupo de doença

In [202]:
df_licencas_grupo_doenca['grupo_doenca'] = df_licencas_grupo_doenca['grupo_doenca'].astype(str)

In [203]:
df_licencas_grupo_doenca = df_licencas_grupo_doenca[(~df_licencas_grupo_doenca['grupo_doenca'].str.contains('GRUPO DE DOENÇAS'))].copy()

## TRATAR OS ACENTOS DO GRUPO DE DOENCA

In [204]:
df_licencas_grupo_doenca['grupo_doenca']= df_licencas_grupo_doenca['grupo_doenca'].str.upper()

In [205]:
def colocaComoOutros(row):
    if ( (row['codigo_grupo_doenca'] != 1)
        and (row['codigo_grupo_doenca'] != 2)
        and (row['codigo_grupo_doenca'] != 3)
        and (row['codigo_grupo_doenca'] != 4)
        and (row['codigo_grupo_doenca'] != 5)
        and (row['codigo_grupo_doenca'] != 6)
        and (row['codigo_grupo_doenca'] != 7)
        and (row['codigo_grupo_doenca'] != 8) ) :
        row['codigo_grupo_doenca'] = 0
    return row
df_licencas_grupo_doenca = df_licencas_grupo_doenca.apply(colocaComoOutros, axis=1)

In [206]:
df_licencas_grupo_doenca = df_licencas_grupo_doenca[['mes','codigo_grupo_doenca']].copy()

In [207]:
df_licencas_grupo_doenca['copia_codigo_doenca'] = df_licencas_grupo_doenca['codigo_grupo_doenca'].copy()

In [208]:
df_licencas_grupo_doenca['mes'] = df_licencas_grupo_doenca['mes'].astype(int)

In [209]:
lista_ordenacao_doenca = ['','a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j','k','l']

In [210]:
lista_grupo_doencas = {'grupos':['OUTRAS CAUSAS',
                       'ACOMPANHANTE',
                       'RESPIRATÓRIA',
                       'GASTROINTESTINAL',
                       'OBSTÉTRICA',
                       'ODONTOLÓGICA',
                       'OSTEOMUSCULAR',
                       'PSIQUIÁTRICA',
                       'SEM CID-10'], 'codigo_grupo_doenca':[0,1,2,3,4,5,6,7,8]}

In [211]:
df_fixo_grupo_doencas = pd.DataFrame(lista_grupo_doencas)

In [212]:
df_fixo_grupo_doencas

             grupos  codigo_grupo_doenca
0     OUTRAS CAUSAS                    0
1      ACOMPANHANTE                    1
2      RESPIRATÓRIA                    2
3  GASTROINTESTINAL                    3
4        OBSTÉTRICA                    4
5      ODONTOLÓGICA                    5
6     OSTEOMUSCULAR                    6
7      PSIQUIÁTRICA                    7
8        SEM CID-10                    8

In [213]:
df_licencas_grupo_doenca.head(1)

   mes  codigo_grupo_doenca  copia_codigo_doenca
0    5                  0.0                  0.0

In [214]:
for mes in df_licencas_grupo_doenca['mes'].unique():
    
    df_aux_doenca = df_licencas_grupo_doenca[df_licencas_grupo_doenca['mes'] == mes].copy()
   
    df_agrupado_doenca = df_aux_doenca.groupby(['codigo_grupo_doenca'], as_index = False).agg({'copia_codigo_doenca': 'count'}).copy()
       
    df_agrupado_doenca.rename(columns={"copia_codigo_doenca": lista_ordenacao_doenca[mes]}, inplace = True)
    
    df_fixo_grupo_doencas = pd.merge(df_fixo_grupo_doencas, df_agrupado_doenca, on = ['codigo_grupo_doenca'], how = 'outer')
    
    df_fixo_grupo_doencas.fillna(0, inplace = True)

In [215]:
df_fixo_grupo_doencas

             grupos  codigo_grupo_doenca     e     f      g     h     i     j
0     OUTRAS CAUSAS                    0  36.0  98.0  119.0  84.0  62.0  99.0
1      ACOMPANHANTE                    1  22.0  16.0   28.0  28.0  13.0  23.0
2      RESPIRATÓRIA                    2  25.0   1.0    1.0   0.0   0.0   4.0
3  GASTROINTESTINAL                    3  10.0   0.0    0.0   0.0   0.0   0.0
4        OBSTÉTRICA                    4   3.0   0.0    1.0   1.0   0.0   0.0
5      ODONTOLÓGICA                    5   9.0   2.0    9.0  21.0  20.0  18.0
6     OSTEOMUSCULAR                    6  14.0   4.0    0.0   7.0   6.0   1.0
7      PSIQUIÁTRICA                    7   0.0   1.0    1.0   1.0   1.0   0.0
8        SEM CID-10                    8  30.0  40.0   41.0  57.0  51.0  54.0

In [216]:
df_fixo_grupo_doencas.rename(columns = {"grupos":"a_grupos", "codigo_grupo_doenca":'a_codigo_grupo_doenca'}, inplace = True)

In [217]:
df_fixo_grupo_doencas.sort_index(axis = 1, inplace = True)

In [218]:
for name in df_fixo_grupo_doencas.columns[2:]:
    df_fixo_grupo_doencas.rename(columns = {name: dic_mes_alfabeto[name]},inplace = True)

In [219]:
lista_colunas_doenca = df_fixo_grupo_doencas.columns

In [220]:
lista_semestre_doenca = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

In [221]:
lista_semestre_doenca = ["JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]

if "JUL" in lista_colunas_doenca:
    lista_meses_doenca = [x for x in lista_semestre_doenca if x not in lista_colunas_doenca]
else:
    lista_meses_doenca = [x for x in lista_semestre_doenca if x not in lista_colunas_doenca]

In [222]:
for mes in lista_meses_doenca:
    df_fixo_grupo_doencas[mes] = 0

In [223]:
df_fixo_grupo_doencas

,a_codigo_grupo_doenca,a_grupos,MAIO,JUN,JUL,AGO,SET,OUT,JAN,FEV,MAR,ABR,NOV,DEZ
0,0,OUTRAS CAUSAS,36.0,98.0,119.0,84.0,62.0,99.0,0,0,0,0,0,0
1,1,ACOMPANHANTE,22.0,16.0,28.0,28.0,13.0,23.0,0,0,0,0,0,0
2,2,RESPIRATÓRIA,25.0,1.0,1.0,0.0,0.0,4.0,0,0,0,0,0,0
3,3,GASTROINTESTINAL,10.0,0.0,0.0,0.0,0.0,0.0,0,0,0,0,0,0
4,4,OBSTÉTRICA,3.0,0.0,1.0,1.0,0.0,0.0,0,0,0,0,0,0
5,5,ODONTOLÓGICA,9.0,2.0,9.0,21.0,20.0,18.0,0,0,0,0,0,0
6,6,OSTEOMUSCULAR,14.0,4.0,0.0,7.0,6.0,1.0,0,0,0,0,0,0
7,7,PSIQUIÁTRICA,0.0,1.0,1.0,1.0,1.0,0.0,0,0,0,0,0,0
8,8,SEM CID-10,30.0,40.0,41.0,57.0,51.0,54.0,0,0,0,0,0,0

In [224]:
df_fixo_grupo_doencas = df_fixo_grupo_doencas[["a_grupos","JAN", "FEV", "MAR", "ABR", "MAIO", "JUN","JUL","AGO","SET","OUT","NOV","DEZ"]].copy()

In [225]:
df_fixo_grupo_doencas.rename(columns = {'a_grupos':'GRUPO DE DOENÇA'}, inplace = True)

In [226]:
df_fixo_grupo_doencas['JAN'] = df_fixo_grupo_doencas['JAN'].astype(int)
df_fixo_grupo_doencas['FEV'] = df_fixo_grupo_doencas['FEV'].astype(int)
df_fixo_grupo_doencas['MAR'] = df_fixo_grupo_doencas['MAR'].astype(int)
df_fixo_grupo_doencas['ABR'] = df_fixo_grupo_doencas['ABR'].astype(int)
df_fixo_grupo_doencas['MAIO'] = df_fixo_grupo_doencas['MAIO'].astype(int)
df_fixo_grupo_doencas['JUN'] = df_fixo_grupo_doencas['JUN'].astype(int)
df_fixo_grupo_doencas['JUL'] = df_fixo_grupo_doencas['JUL'].astype(int)
df_fixo_grupo_doencas['AGO'] = df_fixo_grupo_doencas['AGO'].astype(int)
df_fixo_grupo_doencas['SET'] = df_fixo_grupo_doencas['SET'].astype(int)
df_fixo_grupo_doencas['OUT'] = df_fixo_grupo_doencas['OUT'].astype(int)
df_fixo_grupo_doencas['NOV'] = df_fixo_grupo_doencas['NOV'].astype(int)
df_fixo_grupo_doencas['DEZ'] = df_fixo_grupo_doencas['DEZ'].astype(int)

In [227]:
df_grupo_de_doenca = df_fixo_grupo_doencas.copy()

In [228]:
df_grupo_de_doenca

,GRUPO DE DOENÇA,JAN,FEV,MAR,ABR,MAIO,JUN,JUL,AGO,SET,OUT,NOV,DEZ
0,OUTRAS CAUSAS,0,0,0,0,36,98,119,84,62,99,0,0
1,ACOMPANHANTE,0,0,0,0,22,16,28,28,13,23,0,0
2,RESPIRATÓRIA,0,0,0,0,25,1,1,0,0,4,0,0
3,GASTROINTESTINAL,0,0,0,0,10,0,0,0,0,0,0,0
4,OBSTÉTRICA,0,0,0,0,3,0,1,1,0,0,0,0
5,ODONTOLÓGICA,0,0,0,0,9,2,9,21,20,18,0,0
6,OSTEOMUSCULAR,0,0,0,0,14,4,0,7,6,1,0,0
7,PSIQUIÁTRICA,0,0,0,0,0,1,1,1,1,0,0,0
8,SEM CID-10,0,0,0,0,30,40,41,57,51,54,0,0

# SALVANDOS OS DATA FRAMES

In [229]:
writer = pd.ExcelWriter('Relatório de Atestados.xlsx', engine ='xlsxwriter')

### relatorio geral da quantidade de dias perdidos e da quantidade de licenças médicas gerais
    
df_atestados_meses.to_excel (writer, sheet_name = "relatorio_atestados", index = True, startrow = 1, startcol = 0)

workbook = writer.book

In [230]:
df_atestados_meses.to_excel (writer, sheet_name = "relatorio_atestados", index = True, startrow = 1, startcol = 0)

In [231]:
tam_esp1 = df_atestados_meses.shape[0] + 1 + 3

In [232]:
df_qtd_atestados_unidade.to_excel (writer, sheet_name = "relatorio_atestados", index = False, startrow = tam_esp1)

In [233]:
tam_esp2 = df_qtd_atestados_unidade.shape[0] + tam_esp1 + 1 + 3

In [234]:
df_qtd_dias_perdidos_unidade.to_excel (writer, sheet_name = "relatorio_atestados", index = False, startrow = tam_esp2)

In [235]:
tam_esp3 = df_qtd_dias_perdidos_unidade.shape[0] + tam_esp2 + 1 + 3

In [236]:
df_final_genero.to_excel(writer, sheet_name = "relatorio_atestados", index = True, startrow = tam_esp3)

In [237]:
tam_esp4 = df_final_genero.shape[0] + tam_esp3 + 1 + 3

In [238]:
df_final_intervalos_idade.to_excel(writer, sheet_name = "relatorio_atestados", index = True, startrow = tam_esp4)

In [239]:
tam_esp5 = df_final_intervalos_idade.shape[0] + tam_esp4 + 1 + 3

In [240]:
df_dicionario_funcoes.to_excel(writer, sheet_name = "relatorio_atestados", index = False, startrow = tam_esp5)

In [241]:
tam_esp6 = df_dicionario_funcoes.shape[0] + tam_esp5 + 1 + 3

In [242]:
df_grupo_de_doenca.to_excel(writer, sheet_name = "relatorio_atestados", index = False, startrow = tam_esp6)

## Iniciando Formato da sheet com os cabeçalhos amarelos

In [243]:
sheet_atestado = writer.sheets['relatorio_atestados']

format_atestado_cabecalho = workbook.add_format({
    'bold' : True,
    'align' : 'center',
    'valign': 'vcenter',
    'bg_color' : '#ffe599',
    'font_color': '#000000',
    'border' : 1
})

sheet_atestado.set_column('A:A',27)

sheet_atestado.merge_range("A1:M1", "LICENÇAS MÉDICAS - 2019", format_atestado_cabecalho)
sheet_atestado.merge_range("A{}:M{}".format(tam_esp1, tam_esp1), "QUANTIDADE DE LICENÇAS MÉDICAS POR UNIDADE", format_atestado_cabecalho)
sheet_atestado.merge_range("A{}:M{}".format(tam_esp2, tam_esp2), "QUANTIDADE DE DIAS PERDIDOS POR UNIDADE", format_atestado_cabecalho)
sheet_atestado.merge_range("A{}:M{}".format(tam_esp3, tam_esp3), "QUANTITATIVO DE LICENÇAS MÉDICAS POR GÊNERO ", format_atestado_cabecalho)
sheet_atestado.merge_range("A{}:M{}".format(tam_esp4, tam_esp4), "QUANTITATIVO DE LICENÇAS MÉDICAS POR FAIXA ETÁRIA ", format_atestado_cabecalho)
sheet_atestado.merge_range("A{}:M{}".format(tam_esp5, tam_esp5), "QUANTITATIVO DE LICENÇAS MÉDICAS POR FUNÇÃO", format_atestado_cabecalho)
sheet_atestado.merge_range("A{}:M{}".format(tam_esp6, tam_esp6), "QUANTITATIVO DE LICENÇAS MÉDICAS POR GRUPOS DE DOENÇAS", format_atestado_cabecalho)

In [244]:
writer.save()